vacations/src/Documents/МС_ЗаявкаНаОтпуск/МС_ЗаявкаНаОтпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МС_ЗаявкаНаОтпуск</name>
  <registerRecords>InformationRegister.МС_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.МС_ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.МС_СтатусыЗаявкиНаОтпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

vacations/src/HTTPServices/api/Module.bsl
#Область ОбработчикиСобытий

Функция get_all_docsGET(Запрос)
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	МС_ЗаявкаНаОтпуск.Ссылка КАК Ссылка,
	|	МС_ЗаявкаНаОтпуск.ПометкаУдаления КАК ПометкаУдаления,
	|	МС_ЗаявкаНаОтпуск.Номер КАК Номер,
	|	МС_ЗаявкаНаОтпуск.Дата КАК Дата,
	|	МС_ЗаявкаНаОтпуск.Проведен КАК Проведен,
	|	МС_ЗаявкаНаОтпуск.Вид КАК Вид,
	|	МС_ЗаявкаНаОтпуск.Статус КАК Статус,
	|	МС_ЗаявкаНаОтпуск.Сотрудник КАК Сотрудник,
	|	МС_ЗаявкаНаОтпуск.ДатаНачала КАК ДатаНачала,
	|	МС_ЗаявкаНаОтпуск.ДатаОкончания КАК ДатаОкончания,
	|	МС_ЗаявкаНаОтпуск.Длительность КАК Длительность,
	|	МС_ЗаявкаНаОтпуск.Ответственный КАК Ответственный,
	|	МС_ЗаявкаНаОтпуск.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.МС_ЗаявкаНаОтпуск КАК МС_ЗаявкаНаОтпуск
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Рез = Новый Массив;
	Выборка = ЗапросДокументов.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОднаСтруктура = Новый Структура;
		ОднаСтруктура.Вставить("Номер", 			Выборка.Номер);
		ОднаСтруктура.Вставить("Дата", 				Выборка.Дата);
		ОднаСтруктура.Вставить("Проведен", 			Выборка.Проведен);
		ОднаСтруктура.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ОднаСтруктура.Вставить("Вид", 				Строка(Выборка.Вид));
		ОднаСтруктура.Вставить("Статус", 			Строка(Выборка.Статус));
		ОднаСтруктура.Вставить("Сотрудник", 		Строка(Выборка.Сотрудник));
		ОднаСтруктура.Вставить("ДатаНачала", 		Выборка.ДатаНачала);
		ОднаСтруктура.Вставить("ДатаОкончания", 	Выборка.ДатаОкончания);
		ОднаСтруктура.Вставить("Длительность", 		Выборка.Длительность);
		ОднаСтруктура.Вставить("Ответственный", 	Строка(Выборка.Ответственный));
		ОднаСтруктура.Вставить("Комментарий", 		Выборка.Комментарий);
		
		Рез.Добавить(ОднаСтруктура);
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("data", Рез);
	СтруктураОтвета.Вставить("count", Рез.Количество());
	
	ЗапДЖ = Новый ЗаписьJSON;
	ЗапДЖ.УстановитьСтроку();
	ЗаписатьJSON(ЗапДЖ, СтруктураОтвета);
	ТелоВJSON = ЗапДЖ.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоВJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	
КонецФункции

Функция get_changed_docsGET(Запрос)
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МС_ЗаявкаНаОтпускИзменения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Измененные
	|ИЗ
	|	Документ.МС_ЗаявкаНаОтпуск.Изменения КАК МС_ЗаявкаНаОтпускИзменения
	|ГДЕ
	|	НЕ МС_ЗаявкаНаОтпускИзменения.Ссылка.Номер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МС_ЗаявкаНаОтпуск.Ссылка КАК Ссылка,
	|	МС_ЗаявкаНаОтпуск.ПометкаУдаления КАК ПометкаУдаления,
	|	МС_ЗаявкаНаОтпуск.Номер КАК Номер,
	|	МС_ЗаявкаНаОтпуск.Дата КАК Дата,
	|	МС_ЗаявкаНаОтпуск.Проведен КАК Проведен,
	|	МС_ЗаявкаНаОтпуск.Вид КАК Вид,
	|	МС_ЗаявкаНаОтпуск.Статус КАК Статус,
	|	МС_ЗаявкаНаОтпуск.Сотрудник КАК Сотрудник,
	|	МС_ЗаявкаНаОтпуск.ДатаНачала КАК ДатаНачала,
	|	МС_ЗаявкаНаОтпуск.ДатаОкончания КАК ДатаОкончания,
	|	МС_ЗаявкаНаОтпуск.Длительность КАК Длительность,
	|	МС_ЗаявкаНаОтпуск.Ответственный КАК Ответственный,
	|	МС_ЗаявкаНаОтпуск.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.МС_ЗаявкаНаОтпуск КАК МС_ЗаявкаНаОтпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Измененные КАК ВТ_Измененные
	|		ПО МС_ЗаявкаНаОтпуск.Ссылка = ВТ_Измененные.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Рез = Новый Массив;
	Выборка = ЗапросДокументов.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОднаСтруктура = Новый Структура;
		ОднаСтруктура.Вставить("Номер", 			Выборка.Номер);
		ОднаСтруктура.Вставить("Дата", 				Выборка.Дата);
		ОднаСтруктура.Вставить("Проведен", 			Выборка.Проведен);
		ОднаСтруктура.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ОднаСтруктура.Вставить("Вид", 				Строка(Выборка.Вид));
		ОднаСтруктура.Вставить("Статус", 			Строка(Выборка.Статус));
		ОднаСтруктура.Вставить("Сотрудник", 		Строка(Выборка.Сотрудник));
		ОднаСтруктура.Вставить("ДатаНачала", 		Выборка.ДатаНачала);
		ОднаСтруктура.Вставить("ДатаОкончания", 	Выборка.ДатаОкончания);
		ОднаСтруктура.Вставить("Длительность", 		Выборка.Длительность);
		ОднаСтруктура.Вставить("Ответственный", 	Строка(Выборка.Ответственный));
		ОднаСтруктура.Вставить("Комментарий", 		Выборка.Комментарий);
		
		Рез.Добавить(ОднаСтруктура);
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("data", Рез);
	СтруктураОтвета.Вставить("count", Рез.Количество());
	
	ЗапДЖ = Новый ЗаписьJSON;
	ЗапДЖ.УстановитьСтроку();
	ЗаписатьJSON(ЗапДЖ, СтруктураОтвета);
	ТелоВJSON = ЗапДЖ.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоВJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции

Функция get_one_docGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция get_docs_by_filterGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти
